In [2]:
import pandas as pd

In [3]:
datos = pd.read_csv('H:\\Curso IBM sobre IA\\Archivos para Data Science\\DatosDemograficos.csv')

In [4]:
datos

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [5]:
import os

In [6]:
print(os.getcwd())

h:\Ejercicios Python\CERTIFICADO IBM

In [7]:
os.chdir('H:\\Curso IBM sobre IA\\Archivos para Data Science')

In [8]:
print(os.getcwd())

H:\Curso IBM sobre IA\Archivos para Data Science

In [9]:
datos2 = pd.read_csv('DatosDemograficos.csv')

In [10]:
datos2

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [11]:
# Explorando tus datos

In [12]:
#Número 1 Importar los datos

In [13]:
print(datos)

          Nombre del Pais Codigo de Pais  Tasa de Natalidad  \
0                   Aruba            ABW             10.244
1             Afghanistan            AFG             35.253
2                  Angola            AGO             45.985
3                 Albania            ALB             12.877
4    United Arab Emirates            ARE             11.044
..                    ...            ...                ...
190           Yemen, Rep.            YEM             32.947
191          South Africa            ZAF             20.850
192      Congo, Dem. Rep.            COD             42.394
193                Zambia            ZMB             40.471
194              Zimbabwe            ZWE             35.715

     Usuarios de Internet   Grupo de ingresos
0                    78.9        Ingreso alto
1                     5.9        Ingreso bajo
2                    19.1  Ingreso medio alto
3                    57.2  Ingreso medio alto
4                    88.0        Ingreso alto
..                    ...                 ...
190                  20.0  Ingreso medio bajo
191                  46.5  Ingreso medio alto
192                   2.2        Ingreso bajo
193                  15.4  Ingreso medio bajo
194                  18.5        Ingreso bajo

[195 rows x 5 columns]

In [14]:
datos

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [15]:
# 2.- Número de Filas
len(datos)

195

In [16]:
# 3.- Ver las Columnas
datos.columns

Index(['Nombre del Pais', 'Codigo de Pais', 'Tasa de Natalidad',
       'Usuarios de Internet', 'Grupo de ingresos'],
      dtype='object')

In [17]:
# 4.- Número de columnas
len(datos.columns)

5

In [18]:
# 5.- Filas superiores
datos.head(10)

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9000,Ingreso alto
1,Afghanistan,AFG,35.253,5.9000,Ingreso bajo
2,Angola,AGO,45.985,19.1000,Ingreso medio alto
3,Albania,ALB,12.877,57.2000,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0000,Ingreso alto
5,Argentina,ARG,17.716,59.9000,Ingreso alto
6,Armenia,ARM,13.308,41.9000,Ingreso medio bajo
7,Antigua and Barbuda,ATG,16.447,63.4000,Ingreso alto
8,Australia,AUS,13.200,83.0000,Ingreso alto
9,Austria,AUT,9.400,80.6188,Ingreso alto

In [19]:
# Filas inferiores
datos.tail(7)

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
188,West Bank and Gaza,PSE,30.394,46.6,Ingreso medio bajo
189,Samoa,WSM,26.172,15.3,Ingreso medio bajo
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [20]:
# 7 Información de las columnas
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Nombre del Pais       195 non-null    object
 1   Codigo de Pais        195 non-null    object
 2   Tasa de Natalidad     195 non-null    float64
 3   Usuarios de Internet  195 non-null    float64
 4   Grupo de ingresos     195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [21]:
# 8 Obtener estadísticas de las columnas
datos.describe()

       Tasa de Natalidad  Usuarios de Internet
count         195.000000            195.000000
mean           21.469928             42.076471
std            10.605467             29.030788
min             7.900000              0.900000
25%            12.120500             14.520000
50%            19.680000             41.000000
75%            29.759500             66.225000
max            49.661000             96.546800

In [22]:
datos.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Tasa de Natalidad,195.0,21.469928,10.605467,7.9,12.1205,19.68,29.7595,49.6610
Usuarios de Internet,195.0,42.076471,29.030788,0.9,14.5200,41.00,66.2250,96.5468

In [23]:
### Cambiándole el nombre a las columnas

In [24]:
datos.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [25]:
datos.columns

Index(['Nombre del Pais', 'Codigo de Pais', 'Tasa de Natalidad',
       'Usuarios de Internet', 'Grupo de ingresos'],
      dtype='object')

In [26]:
datos.columns = ['NombrePais', 'CodigoPais', 'TasaNatalidad', 'UsuariosInternet', 'GrupoIngresos']

In [27]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [28]:
# Tres partes
# - Filas
# - Columnas
# - Combinación

In [29]:
#Parte 1: Filas

In [30]:
datos[2:4]

  NombrePais CodigoPais  TasaNatalidad  UsuariosInternet       GrupoIngresos
2     Angola        AGO         45.985              19.1  Ingreso medio alto
3    Albania        ALB         12.877              57.2  Ingreso medio alto

In [31]:
#Ejercicio rápido
# Invierte el DataFrame

In [32]:
datos[::-1]

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
...,...,...,...,...,...
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
2,Angola,AGO,45.985,19.1,Ingreso medio alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
0,Aruba,ABW,10.244,78.9,Ingreso alto

In [33]:
# Ejercicio rápido
# Obtener solamente cada 20 países o filas

In [34]:
datos[::20]

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9000,Ingreso alto
20,Belarus,BLR,12.500,54.1700,Ingreso medio alto
40,Costa Rica,CRI,15.022,45.9600,Ingreso medio alto
60,Gabon,GAB,30.555,9.2000,Ingreso medio alto
80,India,IND,20.291,15.1000,Ingreso medio bajo
100,Libya,LBY,21.425,16.5000,Ingreso medio alto
120,Mozambique,MOZ,39.705,5.4000,Ingreso bajo
140,Poland,POL,9.600,62.8492,Ingreso alto
160,Suriname,SUR,18.455,37.4000,Ingreso medio alto
180,Uruguay,URY,14.374,57.6900,Ingreso alto

In [35]:
# Parte 2. Columnas

In [36]:
datos.columns

Index(['NombrePais', 'CodigoPais', 'TasaNatalidad', 'UsuariosInternet',
       'GrupoIngresos'],
      dtype='object')

In [37]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [38]:
datos['NombrePais'].head()

0                   Aruba
1             Afghanistan
2                  Angola
3                 Albania
4    United Arab Emirates
Name: NombrePais, dtype: object

In [39]:
datos[['NombrePais', 'TasaNatalidad']].head() # Importante los corchetes. Tiene que tratarse como una lista.

             NombrePais  TasaNatalidad
0                 Aruba         10.244
1           Afghanistan         35.253
2                Angola         45.985
3               Albania         12.877
4  United Arab Emirates         11.044

In [40]:
datos[['TasaNatalidad', 'NombrePais']].head()

   TasaNatalidad            NombrePais
0         10.244                 Aruba
1         35.253           Afghanistan
2         45.985                Angola
3         12.877               Albania
4         11.044  United Arab Emirates

In [41]:
# Acceso rápido
datos['TasaNatalidad']

0      10.244
1      35.253
2      45.985
3      12.877
4      11.044
        ...
190    32.947
191    20.850
192    42.394
193    40.471
194    35.715
Name: TasaNatalidad, Length: 195, dtype: float64

In [42]:
datos.TasaNatalidad # Nombre de columna en una sola palabra.

0      10.244
1      35.253
2      45.985
3      12.877
4      11.044
        ...
190    32.947
191    20.850
192    42.394
193    40.471
194    35.715
Name: TasaNatalidad, Length: 195, dtype: float64

In [43]:
# Parte 3 Combinando los dos métodos.

In [44]:
datos[4:8][['NombrePais', 'TasaNatalidad']]

             NombrePais  TasaNatalidad
4  United Arab Emirates         11.044
5             Argentina         17.716
6               Armenia         13.308
7   Antigua and Barbuda         16.447

In [45]:
df2 = datos[['NombrePais', 'TasaNatalidad']]

In [46]:
df2[4:8]

             NombrePais  TasaNatalidad
4  United Arab Emirates         11.044
5             Argentina         17.716
6               Armenia         13.308
7   Antigua and Barbuda         16.447

In [47]:
### Operaciones Matemáticas

In [48]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [68]:
resultado = datos.TasaNatalidad * datos.UsuariosInternet
print(resultado.head())

0    808.2516
1    207.9927
2    878.3135
3    736.5644
4    971.8720
dtype: float64

:

In [50]:
# Agregar Columna:

In [51]:
datos['MiCalculo'] = datos.TasaNatalidad * datos.UsuariosInternet
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos,MiCalculo
0,Aruba,ABW,10.244,78.9,Ingreso alto,808.2516
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo,207.9927
2,Angola,AGO,45.985,19.1,Ingreso medio alto,878.3135
3,Albania,ALB,12.877,57.2,Ingreso medio alto,736.5644
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto,971.8720

In [52]:
#Eliminar una columna

In [53]:
datos.drop('MiCalculo', axis=1)

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [54]:
# Esto no lo borra completamente. Para hacerlo hay que poner:
datos = datos.drop('MiCalculo', axis=1)

In [55]:
datos

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [56]:
### Filtrando un DataFrame

In [57]:
# Filtrado solo se aplica a las filas

In [58]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [59]:
datos.UsuariosInternet < 2

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: UsuariosInternet, Length: 195, dtype: bool

In [60]:
filtro = datos.UsuariosInternet < 2

In [61]:
filtro

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: UsuariosInternet, Length: 195, dtype: bool

In [62]:
datos[filtro]

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
11,Burundi,BDI,44.151,1.3,Ingreso bajo
52,Eritrea,ERI,34.800,0.9,Ingreso bajo
55,Ethiopia,ETH,32.925,1.9,Ingreso bajo
64,Guinea,GIN,37.337,1.6,Ingreso bajo
117,Myanmar,MMR,18.119,1.6,Ingreso medio bajo
127,Niger,NER,49.661,1.7,Ingreso bajo
154,Sierra Leone,SLE,36.729,1.7,Ingreso bajo
156,Somalia,SOM,43.891,1.5,Ingreso bajo
172,Timor-Leste,TLS,35.755,1.1,Ingreso medio bajo

In [63]:
datos.TasaNatalidad > 40

0      False
1      False
2       True
3      False
4      False
       ...
190    False
191    False
192     True
193     True
194    False
Name: TasaNatalidad, Length: 195, dtype: bool

In [64]:
filtro2 = datos.TasaNatalidad > 40

In [65]:
datos[filtro2]

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
2,Angola,AGO,45.985,19.1,Ingreso medio alto
11,Burundi,BDI,44.151,1.3,Ingreso bajo
14,Burkina Faso,BFA,40.551,9.1,Ingreso bajo
65,"Gambia, The",GMB,42.525,14.0,Ingreso bajo
115,Mali,MLI,44.138,3.5,Ingreso bajo
127,Niger,NER,49.661,1.7,Ingreso bajo
128,Nigeria,NGA,40.045,38.0,Ingreso medio bajo
156,Somalia,SOM,43.891,1.5,Ingreso bajo
167,Chad,TCD,45.745,2.3,Ingreso bajo
178,Uganda,UGA,43.474,16.2,Ingreso bajo
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo

In [66]:
# Incluso más interesante

In [67]:
datos[datos.TasaNatalidad > 40 and datos.UsuariosInternet > 2] # Esto daría un error.

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [132]:
filtro & filtro2

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Length: 195, dtype: bool

In [133]:
datos[filtro & filtro2]

    NombrePais CodigoPais  TasaNatalidad  UsuariosInternet GrupoIngresos
11     Burundi        BDI         44.151               1.3  Ingreso bajo
127      Niger        NER         49.661               1.7  Ingreso bajo
156    Somalia        SOM         43.891               1.5  Ingreso bajo

In [135]:
datos[(datos.TasaNatalidad > 40) & (datos.UsuariosInternet < 2)]

    NombrePais CodigoPais  TasaNatalidad  UsuariosInternet GrupoIngresos
11     Burundi        BDI         44.151               1.3  Ingreso bajo
127      Niger        NER         49.661               1.7  Ingreso bajo
156    Somalia        SOM         43.891               1.5  Ingreso bajo

In [136]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [137]:
datos[datos.GrupoIngresos == 'Ingreso alto']

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.90,Ingreso alto
4,United Arab Emirates,ARE,11.044,88.00,Ingreso alto
5,Argentina,ARG,17.716,59.90,Ingreso alto
7,Antigua and Barbuda,ATG,16.447,63.40,Ingreso alto
8,Australia,AUS,13.200,83.00,Ingreso alto
...,...,...,...,...,...
174,Trinidad and Tobago,TTO,14.590,63.80,Ingreso alto
180,Uruguay,URY,14.374,57.69,Ingreso alto
181,United States,USA,12.500,84.20,Ingreso alto
184,"Venezuela, RB",VEN,19.842,54.90,Ingreso alto
185,Virgin Islands (U.S.),VIR,10.700,45.30,Ingreso alto

In [138]:
datos.GrupoIngresos.unique()

array(['Ingreso alto', 'Ingreso bajo', 'Ingreso medio alto',
       'Ingreso medio bajo'], dtype=object)

In [139]:
# Ejercicio rápido
# Encuentra todo del país Malta

In [145]:
datos[datos.NombrePais == 'Malta']

    NombrePais CodigoPais  TasaNatalidad  UsuariosInternet       GrupoIngresos
0        Malta        ABW         10.244              78.9        Ingreso alto
1        Malta        AFG         35.253               5.9        Ingreso bajo
2        Malta        AGO         45.985              19.1  Ingreso medio alto
3        Malta        ALB         12.877              57.2  Ingreso medio alto
4        Malta        ARE         11.044              88.0        Ingreso alto
..         ...        ...            ...               ...                 ...
190      Malta        YEM         32.947              20.0  Ingreso medio bajo
191      Malta        ZAF         20.850              46.5  Ingreso medio alto
192      Malta        COD         42.394               2.2        Ingreso bajo
193      Malta        ZMB         40.471              15.4  Ingreso medio bajo
194      Malta        ZWE         35.715              18.5        Ingreso bajo

[195 rows x 5 columns]

In [146]:
datos

    NombrePais CodigoPais  TasaNatalidad  UsuariosInternet       GrupoIngresos
0        Malta        ABW         10.244              78.9        Ingreso alto
1        Malta        AFG         35.253               5.9        Ingreso bajo
2        Malta        AGO         45.985              19.1  Ingreso medio alto
3        Malta        ALB         12.877              57.2  Ingreso medio alto
4        Malta        ARE         11.044              88.0        Ingreso alto
..         ...        ...            ...               ...                 ...
190      Malta        YEM         32.947              20.0  Ingreso medio bajo
191      Malta        ZAF         20.850              46.5  Ingreso medio alto
192      Malta        COD         42.394               2.2        Ingreso bajo
193      Malta        ZMB         40.471              15.4  Ingreso medio bajo
194      Malta        ZWE         35.715              18.5        Ingreso bajo

[195 rows x 5 columns]

In [148]:
datos[datos.CodigoPais == 'ALB']

  NombrePais CodigoPais  TasaNatalidad  UsuariosInternet       GrupoIngresos
3      Malta        ALB         12.877              57.2  Ingreso medio alto